app/controllers/widgets_controller.rb

SELECT "widgets".* FROM "widgets"
---
  def index
    @widgets = Widget.all

INSERT INTO "widgets" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2021-10-26 15:23:10.530163"], ["updated_at", "2021-10-26 15:23:10.530163"]]
---
  def create
    @widget = Widget.new(widget_params)

    respond_to do |format|
      if @widget.save

UPDATE "widgets" SET "name" = ?, "updated_at" = ? WHERE "widgets"."id" = ?  [["name", "Morning routing"], ["updated_at", "2021-11-11 12:36:29.649233"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @widget.update(widget_params)

DELETE FROM "widgets" WHERE "widgets"."id" = ?  [["id", 1]]
---
  def destroy
    @widget.destroy

SELECT "widgets".* FROM "widgets" WHERE "widgets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_widget
      @widget = Widget.find(params[:id])